{"keras_version": "2.2.2", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "data", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "name": "data", "sparse": false}}, {"inbound_nodes": [[["data", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn_data", "config": {"gamma_regularizer": null, "scale": false, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "beta_constraint": null, "beta_regularizer": null, "name": "bn_data", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["bn_data", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "zero_padding2d_1", "config": {"name": "zero_padding2d_1", "padding": [[3, 3], [3, 3]], "data_format": "channels_last", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv0", "config": {"filters": 64, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [7, 7], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [2, 2], "kernel_constraint": null, "activity_regularizer": null, "name": "conv0", "bias_regularizer": null}}, {"inbound_nodes": [[["conv0", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "bn0", "config": {"gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "beta_constraint": null, "beta_regularizer": null, "name": "bn0", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["bn0", 0, 0, {}]]], "class_name": "Activation", "name": "relu0", "config": {"name": "relu0", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["relu0", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "zero_padding2d_2", "config": {"name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "pooling0", "config": {"data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2], "padding": "valid", "name": "pooling0", "trainable": true}}, {"inbound_nodes": [[["pooling0", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv1", "config": {"filters": 128, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [1, 1], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv1", "bias_regularizer": null}}, {"inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "stage1_unit1_bn1", "config": {"gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 2e-05, "beta_constraint": null, "beta_regularizer": null, "name": "stage1_unit1_bn1", "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]], "class_name": "Activation", "name": "stage1_unit1_relu1", "config": {"name": "stage1_unit1_relu1", "trainable": true, "activation": "relu"}}, {"inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "name": "zero_padding2d_3", "config": {"name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "trainable": true}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_1", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_1", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_2", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_2", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_3", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_3", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_4", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_4", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_5", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_5", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_6", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_6", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_7", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_7", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_8", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_8", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_9", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_9", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_10", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_10", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_11", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_11", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_12", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_12", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_13", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_13", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_14", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_14", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_15", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_15", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_16", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_16", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_17", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_17", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_18", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_18", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_19", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_19", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_20", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_20", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_21", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_21", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_22", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_22", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_23", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_23", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_24", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_24", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_25", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_25", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_26", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_26", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_27", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_27", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_28", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_28", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_29", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_29", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_30", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_30", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_31", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_31", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]], "class_name": "Lambda", "name": "lambda_32", "config": {"function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAczgAAAB8AABkAABkAACFAgBkAABkAACFAgBkAABkAACFAgCI\nAACIAQAUiAAAZAEAF4gBABSFAgBmBAAZUykCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2No\nYW5uZWxzcgIAAAD6mC9ob21lL25vb3IvRG9jdW1lbnRzL01ML21hcHMvdG1wL2thZ2dsZV9zYWx0\nX2Jlc19waGFsYW54L2Jlcy9zZWdtZW50YXRpb25fbW9kZWxzL2JhY2tib25lcy9jbGFzc2lmaWNh\ndGlvbl9tb2RlbHMvY2xhc3NpZmljYXRpb25fbW9kZWxzL3Jlc25leHQvYmxvY2tzLnB52gg8bGFt\nYmRhPjcAAADzAAAAAA==\n", null, [31, 4]], "output_shape_type": "raw", "arguments": {}, "function_type": "lambda", "name": "lambda_32", "trainable": true, "output_shape": null}}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_0", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_0", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_1", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_1", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_2", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_2", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_3", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_3", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_5", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_4", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_4", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_5", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_5", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_7", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_6", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_6", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_7", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_7", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_9", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_8", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_8", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_9", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_9", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_11", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_10", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_10", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_12", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_11", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_11", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_13", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_12", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_12", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_13", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_13", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_15", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_14", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_14", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_15", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_15", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_17", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_16", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_16", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_18", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_17", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_17", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_19", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_18", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_18", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_19", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_19", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_21", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_20", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_20", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_22", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_21", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_21", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_23", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_22", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_22", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_24", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_23", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_23", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_25", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_24", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_24", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_26", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_25", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_25", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_27", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_26", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_26", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_28", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_27", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_27", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_29", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_28", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_28", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_30", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_29", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_29", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_31", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_30", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_30", "bias_regularizer": null}}, {"inbound_nodes": [[["lambda_32", 0, 0, {}]]], "class_name": "Conv2D", "name": "stage1_unit1_conv2_31", "config": {"filters": 4, "use_bias": false, "bias_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_size": [3, 3], "activation": "linear", "trainable": true, "kernel_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "name": "stage1_unit1_conv2_31", "bias_regularizer": null}}, {"inbound_nodes": [[["stage1_unit1_conv2_0", 0, 0, {}], ["stage1_unit1_conv2_1", 0, 0, {}], ["stage1_unit1_conv2_2", 0, 0, {}], ["stage1_unit1_conv2_3", 0, 0, {}], ["stage1_unit1_conv2_4", 0, 0, {}], ["stage1_unit1_conv2_5", 0, 0, {}], ["stage1_unit1_conv2_6", 0, 0, {}], ["stage1_unit1_conv2_7", 0, 0, {}], ["stage1_unit1_conv2_8", 0, 0, {}], ["stage1_unit1_conv2_9", 0, 0, {}], ["stage1_unit1_conv2_10", 0, 0, {}], ["stage1_unit1_conv2_11", 0, 0, {}], ["stage1_unit1_conv2_12", 0, 0, {}], ["stage1_unit1_conv2_13", 0, 0, {}], ["stage1_unit1_conv2_14", 0, 0, {}], ["stage1_unit1_conv2_15", 0, 0, {}], ["stage1_unit1_conv2_16", 0, 0, {}], ["stage1_unit1_conv2_17", 0, 0, {}], ["stage1_unit1_conv2_18", 0, 0, {}], ["stage1_unit1_conv2_19", 0, 0, {}], ["stage1_unit1_conv2_20", 0, 0, {}], ["stage1_unit1_conv2_21", 0, 0, {}], ["stage1_unit1_conv2_22", 0, 0, {}], ["stage1_unit1_conv2_23", 0, 0, {}], ["stage1_unit1_conv2_24", 0, 0, {}], ["stage1_unit1_conv2_25", 0, 0, {}], ["stage1_unit1_conv2_26", 0, 0, {}], ["stage1_unit1_conv2_27", 0, 0, {}], ["stage1_unit1_conv2_28", 0, 0, {}], ["stage1_unit1_conv2_29", 0, 0, {}], ["stage1_unit1_conv2_30", 0, 0, {}], ["stage1_unit1_conv2_31", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "stage1_unit1_bn2", 